# language:ru

  @cucumber
Функционал: Выбор курса через внутренний поиск

  Сценарий: Выбора курса по названию
    Пусть Выбран браузер "firefox"
    Когда Открыта главная страница
    И Выполнен клик по карточке курса 'QA Automation Engineer'
    Тогда На открывшейся странице отображается название курса 'QA Automation Engineer'

  Сценарий: Выбора курса, стартующего раньше всех/позже всех
    Пусть Выбран браузер "chrome"
    Когда Открыта главная страница
    * Выполнен клик по карточке курса, который стартует не раньше 01 ноября 2023
    Тогда Выполнен переход на страницу "https://otus.ru/lessons"
    И Вывожу информацию о выбранном курсе в консоль

  Сценарий: Выбор самого дорого\дешевого курса
    Когда Открыта страница подготовительных курсов
    И Выбрать самый дешевый курс
    Тогда Выполнен переход на страницу "https://otus.ru/online"
    И Вывожу, в консоль, информацию о выбранном подготовительном курсе
